salesforce-soap-api-demo/account-query-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:partner.soap.sforce.com">
   <soapenv:Header>
      <urn:SessionHeader>
         <urn:sessionId>00Dd200000E0tEF!AQEAQGKp9e6OZPIQtP84RQdNxofoudygLD.Dp4FVC6xxrOxyoG7skbtRB8StmtdThJs2bUyQWa.gNfLmTMrRgp_3Ciu25nem</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:query>
         <urn:queryString>SELECT Id, Name FROM Account LIMIT 5</urn:queryString>
      </urn:query>
   </soapenv:Body>
</soapenv:Envelope>
